YafhersLab/STM32_Codes/I2C/Core/Src/main.c
//INCLUDES
#include "stm32f4xx.h"
#include <stdint.h>
#include <stdio.h>
#include <string.h>
#include "utils.h"

//DEFINES

#define I2C1_SDA	B, 7
#define I2C1_SCL	B, 6

//VARIABLES GLOBALES
extern volatile uint32_t uwTicks;
extern volatile uint8_t dataBT;
extern volatile uint16_t adcData;
uint8_t pushDown = 1;
uint8_t pushUp = 1;
uint32_t ticks;
uint8_t flag = 0;
uint8_t valor;
uint16_t adc_values[3];	//las posiciones se guardan de acuerdo al orden definido del DMA

//PROTOTIPOS DE FUNCIONES
void saludar(void);
void GPIO_Config(void);
void PLL_Config(void);
void EXTI_Config(void);
void USART2_Config(void);
void USART6_Config(void);
void USART2_putc(char ch);
void Timer5_Config(void);
void Timer3_ConfigPWM(void);
void ADC_Config(void);
void ADC_ConfigDMA(void);
void DMA_Config(void);
char USART2_getc(void);
void delay_ms(uint32_t d);
void moverServo(int val);
uint8_t UART_Transmit(USART_TypeDef *USARTx, uint8_t *pData, uint16_t size, uint32_t timeout);
uint8_t UART_Receive(USART_TypeDef *USARTx, uint8_t *pData, uint16_t size, uint32_t timeout);
uint8_t button_read(uint8_t current);
uint16_t ADC_getData(uint8_t ch);
uint32_t getTicks();
void USART2_IRQHandler(void);
void I2C1_Init(void);

uint8_t i2c_reg_write(I2C_TypeDef *I2Cx, uint8_t SlaveADDR, uint16_t regADDR, uint8_t *pData, uint16_t len, uint32_t timeout);
uint8_t i2c_reg_read(I2C_TypeDef *I2Cx, uint8_t SlaveADDR, uint16_t regADDR, uint8_t *pData, uint16_t len, uint32_t timeout);

int main(void){
	//Setup
	SysTick_Config(16000);
	I2C1_Init();

	uint8_t reGval = 0x13;
	if(i2c_reg_write(I2C1, 0x68, 0x1A, &reGval, 1, 100) == 0){
		//correcto
	}
	else{
		//incorrect
	}

	//ahora leamos :d
	if(i2c_reg_read(I2C1, 0x68, 0x1B, &reGval, 1, 100) == 0){
		//correcto
	}else{
		//incorrecto
	}

	//Loop
	for(;;){

	}
}

void saludar(void){
	printf("Hola Mundo desde STM32 Cortex M4\r\n");
	printf("Yafhers Mendoza C.\r\n");
	printf("%s  %s\r\n",__TIME__,__DATE__);
}

void GPIO_Config(void){
	//Outputs: PA9 (Verde), PA8 (Azul), PB6 (Rojo), PB5 (Naranja), PB4 (Buzzer), PA5 (Led Interno)
	//Inputs: PC3 (Down), PC2 (Up), PC13 (Boton Interno)

	//1. Habilitamos el reloj del GPIOA, GPIOB, GPIOC (en las STM32F4 GPIO esta en AHB1)
	RCC -> AHB1ENR |= RCC_AHB1ENR_GPIOAEN | RCC_AHB1ENR_GPIOBEN | RCC_AHB1ENR_GPIOCEN;

	//2. Configuramos el modo del pin
	//Outputs
	GPIOA -> MODER &=~ (GPIO_MODER_MODE8 | GPIO_MODER_MODE9 | GPIO_MODER_MODE5);						//restablecer el modo del pin PA8, PA9, PA5
	GPIOB -> MODER &=~ (GPIO_MODER_MODE6 | GPIO_MODER_MODE4 | GPIO_MODER_MODE5);						//restablecer el modo del pin PB6, PB4 y PB5
	GPIOA -> MODER |= (GPIO_MODER_MODE8_0 | GPIO_MODER_MODE9_0 | GPIO_MODER_MODE5_0);					//PA8, PA9 y PA5 salida
	GPIOB -> MODER |= (GPIO_MODER_MODE6_0 |  GPIO_MODER_MODE4_0 | GPIO_MODER_MODE5_0);					//PB6, PB4 y PB5 salida

	//Inputs
	GPIOC -> MODER &=~ (GPIO_MODER_MODE2 | GPIO_MODER_MODE3 | GPIO_MODER_MODE13);						//restablecer el modo del pin PC2, PC3 y PC13 y ponerlo como entrada

	//3. Definimos el tipo de salida
	GPIOA -> OTYPER &=~ (GPIO_OTYPER_OT8 | GPIO_OTYPER_OT9  |GPIO_OTYPER_OT5);							//PA2, PA3, PA5 modo push pull
	GPIOB -> OTYPER &=~ (GPIO_OTYPER_OT6 | GPIO_OTYPER_OT5 | GPIO_OTYPER_OT4);							//PB3, PB4, PB5 modo push pull
	//no toco nada del PC13, PC3 y PC2 pues no es necesario configurar modo ya que son entradas

	//4. Configurar la velocidad de conmutacion
	GPIOA -> OSPEEDR |= GPIO_OSPEEDER_OSPEEDR8 | GPIO_OSPEEDER_OSPEEDR9 | GPIO_OSPEEDER_OSPEEDR5;		//PA2, PA3 y PA5 very high speed
	GPIOB -> OSPEEDR |= GPIO_OSPEEDER_OSPEEDR6 | GPIO_OSPEEDER_OSPEEDR5 | GPIO_OSPEEDER_OSPEEDR4;		//PB3, PB4 y PB5 very high speed
	//no toco nada del PC13, PC3 y PC2 pues no es necesario configurar modo ya que son entradas

	//5. Configurar la resistencia Pull Up / Pull Down
	GPIOA -> PUPDR &=~ (GPIO_PUPDR_PUPD8 | GPIO_PUPDR_PUPD9 | GPIO_PUPDR_PUPD5);						//PA5, PA8 y PA9 sin resistencia
	GPIOB -> PUPDR &=~ (GPIO_PUPDR_PUPD6 | GPIO_PUPDR_PUPD4 | GPIO_PUPDR_PUPD5);						//PB4, PB5 y PB6 sin resistencia
	GPIOC -> PUPDR &=~ GPIO_PUPDR_PUPD13;																//PC13 sin resistencia
	GPIOC -> PUPDR |= GPIO_PUPDR_PUPD2 | GPIO_PUPDR_PUPD3;												//PC2 y PC3 pull up
}

void EXTI_Config(void){
	//Interrupcion Externa: PC13

	//1. Habilitamos el reloj del GPIO y SYSCFG
	RCC -> APB2ENR |= RCC_APB2ENR_SYSCFGEN;																//habilitamos el reloj del SYSCFG
	//RCC -> AHB1ENR |= RCC_AHB1ENR_GPIOCEN;															//habilitamos el reloj del GPIO
	//GPIOC -> MODER &=~ GPIO_MODER_MODE13;																//PC13 como entrada

	//2. Configuramos el disparador de borde
	EXTI -> FTSR |= EXTI_FTSR_TR13;																		//falling, flanco ascendente

	//3. Configuramos la entrega de interrupcion del EXTIx al procesador
	EXTI -> IMR |= EXTI_IMR_IM13;																		//configuramos bit de enmascaramiento sin mascara

	//4. Asignamos el pin de interrupcion a la linea EXTIx
	SYSCFG -> EXTICR[3] &=~ SYSCFG_EXTICR4_EXTI13;														//limpiamos
	SYSCFG -> EXTICR[3] |= SYSCFG_EXTICR4_EXTI13_PC;													//asignamos el PC13

	//5. Configuramos la prioridad de la interrupcion
	EXTI -> PR |= EXTI_PR_PR13;																			//interrupcion 13 como pendiente
	NVIC_ClearPendingIRQ(EXTI15_10_IRQn);																//limpiar bandera de interrupcion
	NVIC_SetPriority(EXTI15_10_IRQn, 3);																//asignamos la prioridad

	//6. Habilitar la interrupcion de la EXTIx
	NVIC_EnableIRQ(EXTI15_10_IRQn);																		//habilitamos la interrupcion en el procesador
}

void PLL_Config(void){
	//1. Apagar el PLL y esperar que la bandera se limpie
	RCC -> CR &=~ RCC_CR_PLLON;	 																		//RCC -> CR &=~ (1U<24); apagar PLL
	while(RCC -> CR & RCC_CR_PLLRDY);																	//esperar que la bandera se limpie del PLL

	//2. Configurar los parametros del PLL
	RCC -> CR |= RCC_CR_HSION;																			//habilitar HSI
	while(!(RCC -> CR & RCC_CR_HSIRDY));																//esperar que la bandera se limpie del HSI
	RCC -> PLLCFGR &=~ RCC_PLLCFGR_PLLSRC;																//selecciono HSI como fuente de PLL
	/* HSI -> 16MHz, hallamos M, N y P del PLL
	 * 16Mhz -> / M <1-2MHz> -> * N <100-432MHz> / P <0-100MHz>
	 * SYSCLK = ((16MHz / 8) * 168) / 8 = 42MHz
	 * M = 8, N = 168, P = 8 */
	RCC -> PLLCFGR &=~ RCC_PLLCFGR_PLLM;																//limpio M
	RCC -> PLLCFGR |= 8U<<RCC_PLLCFGR_PLLM_Pos;															//M = 8
	RCC -> PLLCFGR &=~ RCC_PLLCFGR_PLLN;																//limpio N
	RCC -> PLLCFGR |= 168U<<RCC_PLLCFGR_PLLN_Pos;														//N =168
	RCC -> PLLCFGR &=~ RCC_PLLCFGR_PLLP;																//limpio P
	RCC -> PLLCFGR |= RCC_PLLCFGR_PLLP_0 | RCC_PLLCFGR_PLLP_1;											//P = 8

