YafhersLab/STM32_Codes/I2C/Core/Src/main.c
	//3. Configurar latencia de la flash
	FLASH -> ACR |= FLASH_ACR_PRFTEN | FLASH_ACR_ICEN | FLASH_ACR_DCEN;
	FLASH -> ACR |= FLASH_ACR_LATENCY_1WS;

	//4. Encender el PLL
	RCC -> CR |= RCC_CR_PLLON;																			//habilitar PLL
	while(!(RCC -> CR & RCC_CR_PLLRDY));																//esperar que se active PLL

	//5. Configurar los prescaler de los buses APB1 y APB2
	RCC -> CFGR &=~ RCC_CFGR_PPRE1;																		//limpiamos
	RCC -> CFGR |= 0X5U<<RCC_CFGR_PPRE1_Pos;															//prescaler APB1 / 4 (<50MHz)
	RCC -> CFGR &=~ RCC_CFGR_PPRE2;																		//limpiamos
	RCC -> CFGR |= RCC_CFGR_PPRE2_2;																	//prescaler APB2 / 2

	//6. Seleccionar PLL como fuente de reloj
	RCC -> CFGR |= RCC_CFGR_SW_PLL;																		//activo PLL como fuente de reloj
	while(!(RCC -> CFGR & RCC_CFGR_SWS_PLL));															//espero que se active PLL
	SystemCoreClockUpdate();																			//actualizar el reloj
	return;
}

void USART2_Config(void){
	//1. Configuramos los pines RX y TX 	PA2 -> TX,	PA3 -> RX
	RCC -> AHB1ENR |= RCC_AHB1ENR_GPIOAEN;																//habilito el reloj del GPIOA
	GPIOA -> MODER &=~ (GPIO_MODER_MODE2 | GPIO_MODER_MODE3);											//lipiamos el registro MODER
	GPIOA -> MODER |= GPIO_MODER_MODE2_1 | GPIO_MODER_MODE3_1;											//establezco el modo alternativo del PA2 y PA3
	GPIOA -> OSPEEDR |= GPIO_OSPEEDER_OSPEEDR2 | GPIO_OSPEEDER_OSPEEDR3;								//establezco PA2 y PA3 a la maxima velocidad
	GPIOA -> AFR[0] &=~ (GPIO_AFRL_AFRL2 | GPIO_AFRL_AFRL3);											//limpiamos el AFRL del PA2 y PA3, usamos el 0 ya que el UART2 esta del 0 al 7
	GPIOA -> AFR[0] |= 0x7 << GPIO_AFRL_AFSEL2_Pos | 0x7 << GPIO_AFRL_AFSEL3_Pos;						//asigno la funcion alternativa #7 (USART2) para el PA2 y PA3

	//2. Configuramos el USART2 (depende del dispositivo a trabajar)
	RCC -> APB1ENR |= RCC_APB1ENR_USART2EN;																//habilito el reloj del USART2
	USART2 -> CR1 = 0;																					//limpio registro CR1
	USART2 -> CR1 |= USART_CR1_TE | USART_CR1_RE;														//habilito transmisión y recepción

	//3. Calculamos el Baud Rate (9600), OVER8 = 0
	/*
	 * USART_DIV = 16000000 / (16*9600)
	 * USART_DIV = 104.166666
	 * parte entera: d104 = x68
	 * parte decimal: 0.166666 * 16 = d2.66665
	 * parte decimal (entero mas cercano) : d3 = x3
	 * USART_BRR = 0x683
	 */
	USART2 -> BRR = 0X683;																				//asigno el BRR previamente calculado
	USART2 -> CR1 |= USART_CR1_UE;																		//habilitar UART
	USART2 -> CR1 |= USART_CR1_RXNEIE;																	//habilito la interrupcion por recepcion
	NVIC_ClearPendingIRQ(USART2_IRQn);																	//limpiar bandera de interrupcion
	NVIC_SetPriority(USART2_IRQn, 2);																	//asignamos la prioridad
	NVIC_EnableIRQ(USART2_IRQn);																		//habilito la IRQ de USART2 en la NVIC
}

void USART6_Config(void){
	//1. Configuramos los pines RX y TX 	PA11 -> TX,	PA12 -> RX
	RCC -> AHB1ENR |= RCC_AHB1ENR_GPIOAEN;																//habilito el reloj del GPIOA
	GPIOA -> MODER &=~ (GPIO_MODER_MODE11 | GPIO_MODER_MODE12);											//lipiamos el registro MODER
	GPIOA -> MODER |= GPIO_MODER_MODE11_1 | GPIO_MODER_MODE12_1;										//establezco el modo alternativo del PA2 y PA3
	GPIOA -> OSPEEDR |= GPIO_OSPEEDER_OSPEEDR11_0 | GPIO_OSPEEDER_OSPEEDR12_0;							//establezco PA2 y PA3 a la maxima velocidad
	GPIOA -> OSPEEDR |= GPIO_OSPEEDER_OSPEEDR11_1 | GPIO_OSPEEDER_OSPEEDR12_1;
	GPIOA -> AFR[1] &=~	(GPIO_AFRH_AFRH3 | GPIO_AFRH_AFRH2);											//limpiamos el AFRL del PA2 y PA3, usamos el 0 ya que el UART2 esta del 0 al 7
	GPIOA -> AFR[1] |= 0x8 << GPIO_AFRH_AFSEL11_Pos | 0x8 << GPIO_AFRH_AFSEL12_Pos;						//asigno la funcion alternativa #7 (USART2) para el PA2 y PA3

	//2. Configuramos el USART6 (depende del dispositivo a trabajar)
	RCC -> APB2ENR |= RCC_APB2ENR_USART6EN;																//habilito el reloj del USART2
	USART6 -> CR1 = 0;																					//limpio registro CR1
	USART6 -> CR1 |= USART_CR1_TE | USART_CR1_RE;														//habilito transmisión y recepción

	//3. Calculamos el Baud Rate (9600), OVER8 = 0
	USART6 -> BRR = 0X683;																				//asigno el BRR previamente calculado
	USART6 -> CR1 |= USART_CR1_UE;																		//habilitar UART
	USART6 -> CR1 |= USART_CR1_RXNEIE;																	//habilito la interrupcion por recepcion
	NVIC_ClearPendingIRQ(USART6_IRQn);																	//limpiar bandera de interrupcion
	NVIC_SetPriority(USART6_IRQn, 2);																	//asignamos la prioridad
	NVIC_EnableIRQ(USART6_IRQn);																		//habilito la IRQ de USART2 en la NVIC
}

int __io_putchar(int ch){
	//Serial Wire Viewer ITM
	ITM_SendChar(ch);

	//UART
	while(!(USART2 -> SR & USART_SR_TXE));																//verifica que no hayas datos en el flag de transmision
	USART2 -> DR = (uint8_t)(ch & 0xFF);																//escribo en el data register
	return ch;																							//SR -> Status Register, DR -> Data Register
}

void delay_ms(uint32_t d){
	uint32_t ticksStart = getTicks();
	while(getTicks() - ticksStart <= d);
}

uint8_t UART_Transmit(USART_TypeDef *USARTx, uint8_t *pData, uint16_t size, uint32_t timeout){
	//esto solo sirve para los 8 bits, no sirve si hay paridad
	uint32_t tickStart = getTicks();
	while((getTicks() - tickStart) <= timeout){
		if(USARTx -> SR & USART_SR_TXE){
			USARTx -> DR = *pData;
			pData += 1;
			size -= 1;
			if(size == 0){
				return 0;																				//datos enviados correctamente
			}
		}
	}
	return 1;																							//datos no enviados correctamente
}

uint8_t UART_Receive(USART_TypeDef *USARTx, uint8_t *pData, uint16_t size, uint32_t timeout){
	//esto solo sirve para los 8 bits, no sirve si hay paridad
	uint32_t tickStart = getTicks();
	while((getTicks() - tickStart) <= timeout){
		if(USARTx -> SR & USART_SR_RXNE){
			*pData = USARTx -> DR;
			pData += 1;
			size -= 1;
			if(size == 0){
				return 0;																				//datos enviados correctamente
			}
		}
	}
	return 1;
}

void Timer5_Config(void){
	//Configuraremos el Timer 5
	RCC -> APB1ENR |= RCC_APB1ENR_TIM5EN;																//habilito el reloj para el TIMER5
	//Update Event = 1s -> 1Hz	/	PCLK = 16MHz
	//ARR = (PCLK / (FREQ) * (PSC +1)) - 1
	//ARR = (16MHz / (1) * (1600)) - 1 = 9999
	TIM5 -> CR1 = 0;																					//limpio el registro CR1
	TIM5 -> PSC = 1600 -1;																				//establezco el prescaler
	TIM5 -> ARR = 10000 - 1;																			//estalezco el ARR para una frecuencia de 1Hz
	TIM5 -> DIER |= TIM_DIER_UIE;																		//activo la interrupcion del update interrupt
	NVIC_ClearPendingIRQ(TIM5_IRQn);																	//limpiar bandera de interrupcion
	NVIC_SetPriority(TIM5_IRQn, 2);																		//configurar prioridad
	NVIC_EnableIRQ(TIM5_IRQn);																			//activar IRQ en la NVIC
	TIM5 -> CR1 |= TIM_CR1_CEN;																			//activo el contador
}

void Timer3_ConfigPWM(void){
	RCC -> APB1ENR |= RCC_APB1ENR_TIM3EN;																//habilito el reloj para el TIMER3
	//Update Event = 20ms -> 50Hz	/	PCLK = 16MHz
	//ARR = (PCLK / (FREQ) * (PSC +1)) - 1
	//ARR = (16MHz / (50) * (1600)) - 1 = 199
	TIM3 -> CR1 = 0;																					//limpio el registro CR1
	TIM3 -> PSC = 1600 - 1;																				//establezco el prescaler
	TIM3 -> ARR = 200 - 1;																				//estalezco el ARR para una frecuencia de 50Hz

	//Configuracion del pin PB0 TIM3 CH3 para usar el PWM
	RCC -> AHB1ENR |= RCC_AHB1ENR_GPIOBEN;																//activar el reloj de GPIOB
	GPIOB -> MODER &=~ GPIO_MODER_MODE0;																//limpio el modo del PB0
	GPIOB -> MODER |= GPIO_MODER_MODE0_1;																//establezco el modo de funcion alternativa
	GPIOB -> OSPEEDR |= GPIO_OSPEEDR_OSPEED0;															//maxima velocidad en PB0
	GPIOB -> AFR[0] &=~ GPIO_AFRL_AFSEL0;																//limpio el registro de funcion alternativa
	GPIOB -> AFR[0] |= 0x2 << GPIO_AFRL_AFSEL0_Pos;														//selecciono la funcion alternativa del TIM3

	//Configuracion del canal
	TIM3 -> CCMR2 &=~ TIM_CCMR2_CC3S;																	//configuro el canal como salida
	TIM3 -> CCMR2 &=~ TIM_CCMR2_OC3M;																	//limpio el canal del modo de comparacion
	TIM3 -> CCMR2 |= 0x6 << TIM_CCMR2_OC3M_Pos;															//comparacion mode PWM1, TIMx_CNT < TIMx_CNRR
	TIM3 -> CCER &=~ TIM_CCER_CC3P;																		//ACTIVO A ALTO polaridad
	TIM3 -> CCER |= TIM_CCER_CC3E;																		//habilitar el canal de comparacion
	TIM3 -> CCR3 = 200;																					//tiempo del duty cicle
	TIM3 -> DIER |= TIM_DIER_CC3IE;																		//habilito interrupcion de comparacion
	NVIC_ClearPendingIRQ(TIM3_IRQn);																	//limpiar bandera de interrupcion
	NVIC_SetPriority(TIM3_IRQn, 3);																		//configurar prioridad
	NVIC_EnableIRQ(TIM3_IRQn);																			//activar IRQ en la NVIC
	TIM3 -> CR1 |= TIM_CR1_CEN;																			//iniciar el conteo
}

void ADC_Config(void){
	//1. Configuracion del pin PC4 -> ADC1_14
	RCC -> AHB1ENR |= RCC_AHB1ENR_GPIOCEN;																//activo el reloj del GPIOC
	GPIOC -> MODER |= GPIO_MODER_MODE4;																	//selecciono el modo analogica del PC4
	GPIOC -> PUPDR |= GPIO_PUPDR_PUPD4;																	//desactivo las resistencias pull up / down

	//2. Configuracion del ADC (primero a los ADC comunes)
	RCC -> APB2ENR |= RCC_APB2ENR_ADC1EN;																//habilito el reloj del ADC1
	ADC -> CCR &=~ ADC_CCR_ADCPRE;																		//prescaler desactivado
	ADC -> CCR |= ADC_CCR_TSVREFE;																		//habilito el sensor de temperatura interno

	//3. Configuracion del ADC1 (ahora a mi ADC1 en especifico)
	ADC1 -> CR1 = 0;																					//limpio el registro CR1 de mi ADC1
	ADC1 -> CR1 |= ADC_CR1_OVRIE;																		//habilito la IT para el overrun (sobreescritura de dato)
	ADC1 -> CR1 &=~ ADC_CR1_RES;																		//resolucion de 12 bits
	ADC1 -> CR1 |= ADC_CR1_EOCIE;																		//habilito la IT para el fin de conversion
	ADC1 -> CR2 = 0;																					//limpio el registro CR2 de mi ADC1

#if 1
	//4. Habilitar el disparo externo (DESACTIVAR PARA POLLING)
	ADC1 -> CR2 |= ADC_CR2_EXTEN_0;																		//activo el External Trigger por Rising
	ADC1 -> CR2 |= ADC_CR2_EXTSEL_3;																	//fuente de disparo: TIM3 TRGO (Update Event), TIM_CH es para un pin fisico
	ADC1 -> CR2 &=~ ADC_CR2_ALIGN;																		//alineacion por la derecha
	ADC1 -> CR2 &=~ ADC_CR2_EOCS;																		//no voy a trabajar con DMA
#endif

	//5. Configurar el tiempo de muestreo y la secuencia de conversion
	ADC1 -> SMPR1 |= ADC_SMPR1_SMP14_1 |  ADC_SMPR1_SMP14_0;											//tiempo de muestreo de 56 ciclos de reloj
	ADC1 -> SQR1 = 0;																					//no hay secuencia ya que solo haremos una conversion (aqui va el numero de canales)
	ADC1 -> SQR3 = 14;																					//indica el canal que se va a convertir


