YafhersLab/STM32_Codes/I2C/Core/Src/main.c
	//6. Habilitamos el ADC
	ADC1 -> CR2 |= ADC_CR2_ADON;																		//habilitamos el ADC
	ADC1 -> CR2 |= ADC_CR2_SWSTART;																		//no hace conversión ya que usaremos external trigger

#if 1
	//7. Configuramos la interrupcion del ADC
	NVIC_EnableIRQ(ADC_IRQn);

	//8. Configuramos el External Trigger TIM3 (DESACTIVAR PARA POLLING)
	RCC -> APB1ENR |= RCC_APB1ENR_TIM3EN;																//habilitamos el reloj del timer
	TIM3 -> CR1 = 0;																					//limpiamos el registro CR1 del TIM3
	/*
	 * Calculamos ARR para una frecuencia de 50Hz
	 * ARR = 16E+6 / ((80) * (50)) - 1
	 * ARR = 399
	 * PSC = 79
	 */
	TIM3 -> ARR = 400 - 1;																				//establezco mi ARR para 50 Hz
	TIM3 -> PSC = 80 - 1;																				//establezco mi PSC para 50 Hz
	TIM3 -> CR2 = TIM_CR2_MMS_1;																		//usamos el Update Event
	TIM3 -> CR1 |= TIM_CR1_CEN;																			//iniciar el conteo del tim
#endif
}

void ADC_ConfigDMA(void){
	RCC -> APB2ENR |= RCC_APB2ENR_ADC1EN;																//habilito el reloj del ADC1
	ADC1 -> CR1 |= ADC_CR1_SCAN;																		//activo el modo scan para usar varios canales
	ADC1 -> CR2 |= (ADC_CR2_CONT | ADC_CR2_ADON | ADC_CR2_DMA);											//activo el ADC, el contador y el DMA
	ADC1 -> SQR1 |= (2 << ADC_SQR1_L_Pos);																//selecciono el numero de canales a convertir (3)
	ADC1 -> SQR3 |= (1 << ADC_SQR3_SQ1_Pos);															//asigno el canal 1 como primero en convertir
	ADC1 -> SQR3 |= (2 << ADC_SQR3_SQ2_Pos);															//asgino el canal 2 como segundo en convertir
	ADC1 -> SQR3 |= (3 << ADC_SQR3_SQ3_Pos);															//asigno el canal 3 como tercero en convertir
}

void DMA_Config(void){
	//1. Habilitamos el reloj del DMA
	RCC -> AHB1ENR |= RCC_AHB1ENR_DMA2EN;																//habilito el reloj de mi DMA2

	//2. Configuramos el modo de transferencia del DMA
	DMA2_Stream0 -> CR &=~ DMA_SxCR_DIR;																//trasferencia de periferico a memoria
	DMA2_Stream0 -> PAR = (uint32_t)&ADC1->DR;															//asigno la dirección del periferico
	DMA2_Stream0 -> M0AR = (uint32_t)adc_values;														//asigno la dirección de la memoria
	//DMA2_Stream0 -> NDTR = size;																		//configuro el numero total de datos a transferir

	//3. Configuramos el registro de Control del DMA
	DMA2_Stream0 -> CR = 0;																				//limpiamos el registro de control
	DMA2_Stream0 -> CR |= DMA_SxCR_PL_0;																//prioridad alta
	DMA2_Stream0 -> CR |= DMA_SxCR_DIR_0;																//direccion de transferencia de datos
	DMA2_Stream0 -> CR |= DMA_SxCR_CIRC;																//habilito el modo circular
	DMA2_Stream0 -> CR |= DMA_SxCR_PINC | DMA_SxCR_MINC;												//configuro el modo de periferico y memoria incrementada
	DMA2_Stream0 -> CR |= DMA_SxCR_PSIZE_0 | DMA_SxCR_MSIZE_0;											//configuro el tamaño de los datos de la memoria y los periferico a 16 bits

	//4. Configuramos las interrupciones
	DMA2_Stream0 -> CR |= DMA_SxCR_TCIE;																//interrupciones para la transmision completada
	NVIC_EnableIRQ(DMA2_Stream0_IRQn);																	//habilito la interrupcion en la NVIC

	//5. Configuro el periferico que utilizare para el DMA
	DMA2_Stream0 -> CR &=~ DMA_SxCR_CHSEL;																//selecciono el ADC1

	//6. Habilito el DMA
	DMA2_Stream0 -> CR |= DMA_SxCR_EN;
}

//conversion por polling (desventaja: genera un bloqueo)
uint16_t ADC_getData(uint8_t ch){
	ADC1 -> SQR1 &=~ ADC_SQR1_L;																		//indicar que haremos una unica conversion
	ADC1 -> SQR3 = ch;																					//indica el canal que se va a convertir
	ADC1 -> CR2 |= ADC_CR2_SWSTART;																		//hago un disparo por software (polling)
	while(!(ADC1 -> SR & ADC_SR_EOC));																	//espero a que se termine la conversion
	return ADC1 -> DR;																					//retorno el valor convertido
}

uint32_t getTicks(){
	return uwTicks;
}

void USART2_putc(char ch){
	while(!(USART2 -> SR & USART_SR_TXE));
	USART2 -> DR = ch;
}

char USART2_getc(void){
	while(!(USART2 -> SR & USART_SR_RXNE));
	return USART2 -> DR;
}

uint8_t button_read(uint8_t current){
	static uint32_t ticks = 0;
	static uint8_t lastState = 1;	//1 pull up, 0 pull down
	//filtrado
	if((getTicks() - ticks) > 20){		//el 20 es opcional
		ticks = getTicks();
		if(lastState != current){
			lastState = current;
			if(current == 0){			//flanco ascendente
				printf("3\n");
				return 0;
			}
		}
	}
	return 1;
}

void I2C1_Init(void){
	uint32_t temp;

	// 1. Configuracion del Pinout
	RCC -> AHB1ENR |= GPIOX_CLOCK(I2C1_SCL);															// habilito el reloj de los pines GPIO del SCL y SDA
	GPIOX_MODER(MODE_ALTER, I2C1_SCL);																	// funcion alternativa del SCL
	GPIOX_MODER(MODE_ALTER, I2C1_SDA);																	// funcion alternativa del SDA
	GPIOB -> OTYPER |= GPIO_OTYPER_OT6 | GPIO_OTYPER_OT7;	 											// modoopen drain para SCL y SDA
	GPIOX_OSPEEDR(MODE_SPD_VHIGH, I2C1_SCL);															// velocidad maxima para SCL
	GPIOX_OSPEEDR(MODE_SPD_VHIGH, I2C1_SDA);															// velocidad maxima para SDA
	GPIOX_AFR(4, I2C1_SCL);																				// asigno la funcion alternativa
	GPIOX_AFR(4, I2C1_SDA);																				// asigno la funcion alternativa
	GPIOX_PUPDR(MODE_PU_UP, I2C1_SDA);																	// activo el pull up de SDA
	GPIOX_PUPDR(MODE_PU_UP, I2C1_SCL);																	// activo el pull up de SCL

	// 2. Configuracion del I2C
	RCC -> APB1ENR |= RCC_APB1ENR_I2C1EN;																// habilito el reloj del I2C1
	//calculemos el PCLK
	temp = SystemCoreClock / 1000000;																	// almaceno en temp la frecuencia en Mega Hertz ya que en FREQ se pone en MHz
	I2C1 -> CR2 &=~ I2C_CR2_FREQ;																		// limpio los bits de frecuencia del CR2
	I2C1 -> CR2 |= (temp & 0x3F);																		// asignamos la frecuencia en CR2 (0X3F : 6 primeros bits: FREQ)

	// 3. Calculo del CCR
	/* Single Mode : 100KHz
	 * CCR = PCLK / (2*100KHz)
	 *
	 * Fast Mode: 400KHz
	 * Si DUTY == 0:
	 * CCR = PCLK / (3 * 400KHz)
	 *
	 * Si DUTY == 1:
	 * CCR = PCLK / (25 * 400KHz)*/
	temp = SystemCoreClock / (25 * 400E+3);																// aplico la formula para Fast Mode con Duty = 1
	I2C1 -> CCR |= (temp & 0xFFF);																		// asigno el valor calculado en CCR
	I2C1 -> CCR |= I2C_CCR_FS;				 															// habilito el modo fast
	I2C1 -> CCR |= I2C_CCR_DUTY;																		// indico que se trabajara con duty


