YafhersLab/STM32_Codes/I2C/Core/Src/main.c
	// 4. Calculo del TRISE
	/* indica el DATA HOLD TIME / DATA SETUP TIME
	 * Single Mode: 100KHz
	 * TRISE = PCLK / 1000000 + 1
	 *
	 * Fast Mode: 400KHz
	 * TRISE = (PCLK * 300) / (1000000000U) + 1*/
	temp = (16E+6 * 300) / 1000000000u + 1;																// aplico la formula para el Fast Mode
	I2C1 -> TRISE = temp;																				// asigno TRISE

	// 5. Configuraciones finales del I2C
	I2C1 -> OAR1 = 0x12;																				// asigno la direccion del esclavo I2C
	I2C1 -> CR1 |= I2C_CR1_PE;																			// habilito el I2C
}

uint8_t i2c_reg_write(I2C_TypeDef *I2Cx, uint8_t SlaveADDR, uint16_t regADDR, uint8_t *pData, uint16_t len, uint32_t timeout){
	uint8_t temp = 0;
	uint32_t tickStart = getTicks();

	// 1. Verificamos que el bus este libre
	do{
		if(getTicks() - tickStart >= timeout){
			return 1;
		}
	}while(I2Cx -> SR2 & I2C_SR2_BUSY);																	// espero que el bus este libre

	I2Cx -> CR1 |= I2C_CR1_START;																		// genero el start condition

	do{
		if((getTicks() - tickStart) >= timeout){
			I2Cx -> CR1 |= I2C_CR1_STOP;
			return 1;
		}
	}while(!(I2Cx -> SR1 & I2C_SR1_SB));																// espero que se genere el Start Bit

	// 2. Enviamos la direccion del esclavo
	SlaveADDR = SlaveADDR << 1;																			// hacemos un barrido en la direccion para colocar el bit R/W
	SlaveADDR &=~ 1;	//Write																			// escribo un write
	I2Cx -> DR = SlaveADDR;																				// envio la direccion junto al bit de write

	do{
		if((getTicks() - tickStart) >= timeout){
			I2Cx -> CR1 |= I2C_CR1_STOP;
			return 1;
		}
	}while(!(I2Cx -> SR1 & I2C_SR1_ADDR));																// espero que se reciba la direccion correctamente

	temp = I2Cx -> SR1;																					// limpio el registro SR1
	temp = I2Cx -> SR2;																					// limpio el registro SR2
	(void) temp;

	// 3. Enviamos la direccion de la region a escribir
	do{
		if((getTicks() - tickStart) >= timeout){
			I2Cx -> CR1 |= I2C_CR1_STOP;
			return 1;
		}
	}while(!(I2Cx -> SR1 & I2C_SR1_TXE));																// verificar de que el buffer de transmision este libre

	I2Cx -> DR = regADDR;																				// envio la direccion de la region
	//1Byte, para 2Byte: MSB y luego LSB I2C -> DR = (regAddr >> 8); I2C -> DR = regADDR & 0xFF

	// 4. Enviamos la data en esa direccion
	while(len > 0){
		do{
			if((getTicks() - tickStart) >= timeout){
				I2Cx -> CR1 |= I2C_CR1_STOP;
				return 1;
			}
		}while(!(I2Cx -> SR1 & I2C_SR1_TXE));															// se verifica que el buffer este libre

		I2Cx -> DR = *pData;																			// envio la data
		pData += 1;																						// desplazo en 1 posicion la data
		len -= 1;																						// 1 bit menos por leer
	}

	do{
		if(getTicks() - tickStart > timeout){
			I2Cx -> CR1 |= I2C_CR1_STOP;
			return 1;
		}
	}while(((I2Cx -> SR1 & I2C_SR1_TXE) == 0) && ((I2Cx -> SR1 & I2C_SR1_BTF) == 0));					// espero que el buffer de transmision este libre y que la data se haya transferido

	I2Cx -> CR1 |= I2C_CR1_STOP;																		// mando la condicion de parada
	return 0;
}

uint8_t i2c_reg_read(I2C_TypeDef *I2Cx, uint8_t SlaveADDR, uint16_t regADDR, uint8_t *pData, uint16_t len, uint32_t timeout){
	uint8_t temp = 0;
	uint32_t tickStart = getTicks();

	// 1. Verificamos que el bus este libre
	do{
		if(getTicks() - tickStart >= timeout){
			return 1;
		}
	}while(I2Cx -> SR2 & I2C_SR2_BUSY);																	// espero que el bus este libre

	I2Cx -> CR1 |= I2C_CR1_START;																		// genero el start condition

	do{
		if((getTicks() - tickStart) >= timeout){
			I2Cx -> CR1 |= I2C_CR1_STOP;
			return 1;
		}
	}while(!(I2Cx -> SR1 & I2C_SR1_SB));																// espero que se genere el Start Bit

	// 2. Enviamos la direccion del esclavo
	SlaveADDR = SlaveADDR << 1;																			// hacemos un barrido en la direccion para colocar el bit R/W
	SlaveADDR &=~ 1;	//Write																			// escribo un write
	I2Cx -> DR = SlaveADDR;																				// envio la direccion junto al bit de write

	do{
		if((getTicks() - tickStart) >= timeout){
			I2Cx -> CR1 |= I2C_CR1_STOP;
			return 1;
		}
	}while(!(I2Cx -> SR1 & I2C_SR1_ADDR));																// espero que se reciba la direccion correctamente

	temp = I2Cx -> SR1;																					// limpio el registro SR1
	temp = I2Cx -> SR2;																					// limpio el registro SR2
	(void) temp;

	// 3. Enviamos la direccion de la region a escribir
	do{
		if((getTicks() - tickStart) >= timeout){
			I2Cx -> CR1 |= I2C_CR1_STOP;
			return 1;
		}
	}while(!(I2Cx -> SR1 & I2C_SR1_TXE));																// verificar de que el buffer de transmision este libre

	I2Cx -> DR = regADDR;

	// 4. Genero una nueva condicion de inicio
	do{
		if(getTicks() - tickStart > timeout){
			I2Cx -> CR1 |= I2C_CR1_STOP;
			return 1;
		}
	}while(((I2Cx -> SR1 & I2C_SR1_TXE) == 0) && ((I2Cx -> SR1 & I2C_SR1_BTF) == 0));					// espero que el buffer de transmision este libre y que la data se haya transferido

	I2Cx -> CR1 |= I2C_CR1_START;																		// envio la condicion de start

	do{
		if((getTicks() - tickStart) >= timeout){
			I2Cx -> CR1 |= I2C_CR1_STOP;
			return 1;
		}
	}while(!(I2Cx -> SR1 & I2C_SR1_SB));																// espero que se genera la condicion de start

	// 5. Envio nuevamente la direccion del esclavo pero para Read
	SlaveADDR |= 1;																						// hacemos un read
	I2Cx -> DR = SlaveADDR;																				// envio la direccion pero con read
	do{
		if((getTicks() - tickStart) >= timeout){
			I2Cx -> CR1 |= I2C_CR1_STOP;
			return 1;
		}
	}while(!(I2Cx -> SR1 & I2C_SR1_ADDR));																// espero que se reciba la direccion correctamente

	temp = I2Cx -> SR1;																					// limpio el registro SR1
	temp = I2Cx -> SR2;																					// limpio el registro SR2
	(void) temp;

	I2Cx -> CR1 |= I2C_CR1_ACK;																			//enviamos un ACK ya que el maestro recibe el dato

	// 6. Iniciamos la lectura del esclavo
	while(len > 0){
		if(len == 1){
			I2Cx -> CR1 &=~ I2C_CR1_ACK;																// finalizo la comunicacion enviando un NACK
			do{
				if(getTicks() - ticks > timeout){
					I2Cx -> CR1 |= I2C_CR1_STOP;
					return 1;
				}
			}while((I2Cx->SR1 & I2C_SR1_RXNE) == 0);													// espero que el buffer de recepcion este libre

			*pData = I2Cx -> DR;																		// leo la data
			len --;																						// 1 bit menos por leer
			break;
		}else{
			do{
				if((getTicks() - ticks) > timeout){
					I2Cx -> CR1 |= I2C_CR1_STOP;
					return 1;
				}
			}while((I2Cx -> SR1 & I2C_SR1_RXNE) == 0);													// espero que el buffer de recepcion este libre

			*pData = I2Cx -> DR;																		// guardo la data en pData
			pData++;																					// desplazo 1 posicion
			len--;																						// 1 bit menos por leer
			}
		}
	return 0;
}
